# AllRuleParametersApplicable Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ParameterFilterElement..::..AllRuleParametersApplicable Method
ParameterFilterElement Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AllRuleParametersApplicable(ElementFilter) | Checks that the parameters of the rules used by the given ElementFilter are valid for this filter's categories. |
| AllRuleParametersApplicable(Document, ICollection<(Of <<'(ElementId>)>>), ElementFilter) | Checks that the parameters of the given ElementFilter (representing a combination of rules) are valid for the given set of categories. |

# See Also
ParameterFilterElement Class
ParameterFilterElement Members
Autodesk.Revit.DB Namespace